```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project.project will be created
  + resource "google_project" "project" {
      + auto_create_network = true
      + folder_id           = "273732920377"
      + id                  = (known after apply)
      + name                = "platform-demo"
      + number              = (known after apply)
      + project_id          = "platform-demo-377915"
      + skip_delete         = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
